---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireTypeSet.Contains(Autodesk.Revit.DB.Electrical.WireType)
source: html/750943dc-2e95-f55e-a155-8071e3ed7f8c.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSet.Contains Method

Tests for the existence of a wire type within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	WireType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.WireType`) - The wire type to be searched for.

## Returns
The Contains method returns True if the wire type is within the set, otherwise False.